tap "homebrew/bundle"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU awk utility
brew "gawk"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Port scanning utility for large networks
brew "nmap"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Password generator
brew "pwgen"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Application uninstaller
cask "appcleaner"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Cross-platform AI benchmark to evaluate AI workload performance
cask "geekbench-ml"
# Open-source video transcoder
cask "handbrake"
# System monitoring app
cask "istat-menus"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Automator software to start apps, run scripts or commands and more
cask "lingon-x"
# Discover, download, and run local LLMs
cask "lm-studio"
# Clipboard manager
cask "maccy"
# Power management and monitoring for Apple Mx processors
cask "mx-power-gadget"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Graphical client for Git version control
cask "sourcetree"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Network monitoring and troubleshooting tool
cask "wifiman"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "pkl.pkl-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "timonwong.shellcheck"
