tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Library for command-line editing
brew "readline"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Improved top (interactive process viewer)
brew "htop"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# General-purpose data compression with high compression ratio
brew "xz"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Port scanning utility for large networks
brew "nmap"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Password generator
brew "pwgen"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool Command Language
brew "tcl-tk"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# General-purpose lossless data-compression library
brew "zlib"
# Application uninstaller
cask "appcleaner"
# System monitoring app
cask "istat-menus"
# Wallet desktop application to maintain multiple cryptocurrencies
cask "ledger-live"
# Clipboard manager
cask "maccy"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Graphical client for Git version control
cask "sourcetree"
# VPN client for secure internet access and private browsing
cask "tunnelbear"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Application for generating TOTP and HOTP codes
cask "yubico-authenticator"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
vscode "DavidAnson.vscode-markdownlint"
vscode "mhutchie.git-graph"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "timonwong.shellcheck"
