tap "homebrew/bundle"

# Essentials & GNU build tools
brew "coreutils"
brew "gawk"
brew "gdbm"
brew "gettext"
brew "gnutls"
brew "gmp"
brew "ncurses"
brew "npth"
brew "openssl@3"
brew "readline"
brew "tcl-tk"

# asdf + Python build support
brew "asdf"

# GPG + YubiKey support
brew "gnupg"
brew "pinentry"
brew "pinentry-mac"
brew "ykman"
brew "ykpers"

# Terminal tools
brew "bat"
brew "htop"
brew "pwgen"
brew "stow"
brew "tmux"
brew "vim"

# GUI apps (minimal but essential)
cask "maccy"
cask "rectangle"
cask "visual-studio-code"
